Тест_ЗУП_31_КОРП/src/Catalogs/ЭлектронныеРесурсы/ЭлектронныеРесурсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлектронныеРесурсы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Учащихся</name>
      <description>Учащихся</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентичныйРесурс</name>
    <comment>Важно! Данный реквизит должен стоять перед реквизитом ФайлЗапуска, так как при экспорте необходимо сначала зарегистрировать идентичный ресурс, а потом файл, иначе ресурс будет экспортирован не полностью.</comment>
    <type>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементЗапуска</name>
    <type>
      <types>CatalogRef.ЭлементыЭлектронныхРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯкорьЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SCO</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключитьAPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдинственныйЭлемент</name>
    <type>
      <types>CatalogRef.ЭлементыЭлектронныхРесурсов</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/ТипыЭлементовЭлектронныхРесурсов/ТипыЭлементовЭлектронныхРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлементовЭлектронныхРесурсов</name>
  <enumValues>
    <name>File</name>
  </enumValues>
  <enumValues>
    <name>Folder</name>
  </enumValues>
  <enumValues>
    <name>Media</name>
  </enumValues>
  <enumValues>
    <name>Image</name>
  </enumValues>
  <enumValues>
    <name>Video</name>
  </enumValues>
  <enumValues>
    <name>Audio</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
  <enumValues>
    <name>Text</name>
  </enumValues>
  <enumValues>
    <name>Presentation</name>
  </enumValues>
  <enumValues>
    <name>Table</name>
  </enumValues>
  <enumValues>
    <name>YouTube</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/ЭлементыЭлектронныхРесурсов/ЭлементыЭлектронныхРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыЭлектронныхРесурсов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ЭлектронныеРесурсы</owners>
  <attributes>
    <name>FlashВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FlashЦветФона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выравнивать</name>
    <type>
      <types>EnumRef.СпособыВыравниванияЭлементовЭлектронногоКурса</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьПоСсылке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьВнешнимПриложением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлементовЭлектронныхРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроигрыватьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВнешнийЭлемент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуМодально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуБезопасно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеЭлемента</name>
    <attributes>
      <name>КодДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеДанных</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрисоединенныйФайл</name>
      <type>
        <types>CatalogRef.ЭлементыЭлектронныхРесурсовПрисоединенныеФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеОбмена</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеДляИндексирования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/ЭлектронныеРесурсы/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Возвращает единственный элемент ресурса.
//
// Если в ресурсе нет элементов или их больше одного,
// включая группы, то возвращает Неопределено.
// Помимо этой функции единственный элемент можно
// получить из реквизита ресурса.
//
Функция ЕдинственныйЭлемент(Ресурс) Экспорт	 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	ЭлементыЭлектронныхКурсов.Ссылка
		|ИЗ
		|	Справочник.ЭлементыЭлектронныхРесурсов КАК ЭлементыЭлектронныхКурсов
		|ГДЕ
		|	ЭлементыЭлектронныхКурсов.ПометкаУдаления = ЛОЖЬ
		|	И ЭлементыЭлектронныхКурсов.Владелец = &Ресурс";

	Запрос.УстановитьПараметр("Ресурс", Ресурс);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;		
	
КонецФункции

Функция ДеревоЭлементов(Ресурс) Экспорт
	 
	// Делаем проверки
	//
	
	ДанныеРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ресурс, "ИдентичныйРесурс, SCO");
	ИдентичныйРесурс = ДанныеРесурса.ИдентичныйРесурс;
	
	Если ЗначениеЗаполнено(ИдентичныйРесурс) Тогда
		// Если указан идентичный ресурс, то берем файлы из него.
		Возврат ДеревоЭлементов(ИдентичныйРесурс);  // Рекурсия
	КонецЕсли;
	
	// Выбираем все элементы ресурса
	//
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЭлементыРесурса.Ссылка КАК Ссылка,
	               |	ЭлементыРесурса.ИмяФайла КАК ИмяФайла,
	               |	ЭлементыРесурса.ЭтоГруппа КАК ЭтоГруппа,
	               |	ЭлементыРесурса.Наименование КАК Наименование,
	               |	ЭлементыРесурса.Скрывать КАК Скрывать,
	               |	ЭлементыРесурса.Владелец КАК Владелец,
	               |	ЭлементыРесурса.Тип КАК ТипЭлемента,
	               |	ЭлементыРесурса.ЭтоВнешнийЭлемент КАК ЭтоВнешнийЭлемент,
	               |	ЭлементыРесурса.ДатаИзменения КАК ДатаИзменения,
	               |	ВЫБОР
	               |		КОГДА ЭлементыРесурса.ЭтоГруппа
	               |			ТОГДА 2
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Картинка
	               |ИЗ
	               |	Справочник.ЭлементыЭлектронныхРесурсов КАК ЭлементыРесурса
	               |ГДЕ
	               |	ЭлементыРесурса.ПометкаУдаления = ЛОЖЬ
	               |	И ЭлементыРесурса.Владелец = &Ресурс
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование ИЕРАРХИЯ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ресурс", Ресурс);
	
	ВыборкаВсехФайловРесурса = Запрос.Выполнить();
	ДеревоФайловРесурса      = ВыборкаВсехФайловРесурса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Если НЕ ДанныеРесурса.SCO Тогда // Ресурсы SCORM никак не меняем
		ПодготовитьДеревоЭлементовДляВыгрузки(ДеревоФайловРесурса.Строки);	
	КонецЕсли;
		
	// Завершаем
	//
	
	Возврат ДеревоФайловРесурса;
	
КонецФункции

Процедура ПодготовитьДеревоЭлементовДляВыгрузки(СтрокиДереваФайлов)
	
	Для каждого Строка Из СтрокиДереваФайлов Цикл
		
		Если НЕ Строка.ЭтоВнешнийЭлемент Тогда
			Строка.ИмяФайла = Справочники.ЭлементыЭлектронныхРесурсов.ИмяФайлаДляВыгрузки(Строка.Ссылка, Строка.ИмяФайла, Строка.ТипЭлемента);
		КонецЕсли;		
			
		Если Строка.Строки.Количество() > 0 Тогда
			ПодготовитьДеревоЭлементовДляВыгрузки(Строка.Строки); // Рекурсия
		КонецЕсли;		
		
	КонецЦикла;
		
КонецПроцедуры

Функция СтруктураФайловРесурса(Ресурс, СтрокиДереваФайлов, Знач УровеньВложенности, ЭлектронныйРесурс, ИдентификаторФормы = Неопределено) Экспорт
			
	МассивФайлов = Новый Массив();
	
	Если СтрокиДереваФайлов.Количество() = 0 Тогда
		Возврат МассивФайлов;
	КонецЕсли;
	
	Для каждого Строка Из СтрокиДереваФайлов Цикл
		
		Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.YouTube Тогда		
			Продолжить; // Нет файла для этого типа элемента ресурса
		КонецЕсли;
		
		Файл = ПустаяСтруктураФайлаДляВыгрузки();
		
		Файл.ИмяФайла = Строка.ИмяФайла;
		Файл.ЭтоКаталог = Строка.ЭтоГруппа;
		
		Если Строка.ЭтоГруппа Тогда
			
			МассивФайловРесурса = СтруктураФайловРесурса(Ресурс, Строка.Строки, УровеньВложенности + 1, ЭлектронныйРесурс, ИдентификаторФормы); // Рекурсия
			Файл.ПодчиненныеФайлы = МассивФайловРесурса;
			
		Иначе
			
			Если Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Text Тогда
				
				ФорматированныйДокумент = Справочники.ЭлементыЭлектронныхРесурсов.ДанныеЭлементаДляВыгрузки(Строка.Ссылка, Строка.ТипЭлемента);
				ФорматированныйДокументСтруктура = ЭлектронноеОбучениеСлужебный.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокумент, Строка.Ссылка.УникальныйИдентификатор(),,Истина,Ложь);
				
				Файл.ИмяФайла = ""; // Чтобы распаковался в корень ресурса				
				Файл.ТипЭлемента = "Folder";
				Файл.ДвоичныеДанные = ФорматированныйДокументСтруктура.ДвоичныеДанные;
				
			ИначеЕсли Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Document
				ИЛИ Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Presentation Тогда
				
				Файл.ИмяФайла = ""; // Чтобы распаковался в корень ресурса
				Файл.ТипЭлемента = "Folder";
				Файл.ДвоичныеДанные = Справочники.ЭлементыЭлектронныхРесурсов.ДанныеЭлементаДляВыгрузки(Строка.Ссылка, Строка.ТипЭлемента, ИдентификаторФормы);
				
			ИначеЕсли Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Video Тогда	
				
				ФорматДляВыгрузки = Справочники.ЭлементыЭлектронныхРесурсов.ФорматВидеоФайлаДляВыгрузки(Строка.Ссылка);				
				Файл.ИмяФайла = "video." + НРег(ФорматДляВыгрузки);				
				Файл.ДвоичныеДанные = Справочники.ЭлементыЭлектронныхРесурсов.ДанныеЭлементаДляВыгрузки(Строка.Ссылка, Строка.ТипЭлемента, ИдентификаторФормы);								
				
			ИначеЕсли Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Audio Тогда	
				
				ФорматДляВыгрузки = НРег(ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(Строка.ИмяФайла)));
				Файл.ИмяФайла = "audio." + ФорматДляВыгрузки;				
				Файл.ДвоичныеДанные = Справочники.ЭлементыЭлектронныхРесурсов.ДанныеЭлементаДляВыгрузки(Строка.Ссылка, Строка.ТипЭлемента, ИдентификаторФормы);
				
			ИначеЕсли Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.File
				ИЛИ Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Image
				ИЛИ Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.DataProcessor
				ИЛИ Строка.ТипЭлемента = Перечисления.ТипыЭлементовЭлектронныхРесурсов.Media Тогда	
				
				Файл.ИмяФайла = Строка.ИмяФайла;				
				Файл.ДвоичныеДанные = Справочники.ЭлементыЭлектронныхРесурсов.ДанныеЭлементаДляВыгрузки(Строка.Ссылка, Строка.ТипЭлемента, ИдентификаторФормы);
				
			Иначе
				
				ВызватьИсключение НСтр("ru = 'Неизвестный тип элемента'");
				
			КонецЕсли;				
						
		КонецЕсли;
		
		МассивФайлов.Добавить(Файл);
		
	КонецЦикла;
	
	Возврат МассивФайлов;
	
КонецФункции

Функция ПустаяСтруктураФайлаДляВыгрузки() Экспорт
	
	Файл = Новый Структура;
	
	Файл.Вставить("ИмяФайла", "");
	Файл.Вставить("ЭтоКаталог", "");
	Файл.Вставить("ДвоичныеДанные", Неопределено);
	Файл.Вставить("ПодчиненныеФайлы", Неопределено);
	Файл.Вставить("ТипЭлемента", Неопределено); // Строка

	Возврат Файл;
	
КонецФункции

Функция ЭлементРесурсаПоОтносительномуПути(Знач Ресурс, Знач ОтносительныйПутьКФайлу) Экспорт
	
	РазделительПути = ЭлектронноеОбучениеСлужебныйКлиентСервер.РазделительПути(ОтносительныйПутьКФайлу);
	ОтносительныйПутьМассив = СтрРазделить(ОтносительныйПутьКФайлу, РазделительПути, Ложь);
	КоличествоЭлементовПути = ОтносительныйПутьМассив.Количество();
	ИмяФайла = ОтносительныйПутьМассив[КоличествоЭлементовПути-1];
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭлементыЭлектронныхРесурсов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭлементыЭлектронныхРесурсов КАК ЭлементыЭлектронныхРесурсов
		|ГДЕ
		|	ЭлементыЭлектронныхРесурсов.ПометкаУдаления = ЛОЖЬ
		|	И ЭлементыЭлектронныхРесурсов.ИмяФайла = &ИмяФайла
		|	И ЭлементыЭлектронныхРесурсов.Владелец = &Ресурс";
	
	Запрос.УстановитьПараметр("ИмяФайла", ИмяФайла);
	Запрос.УстановитьПараметр("Ресурс", Ресурс);	
		
	УровеньРодителя = 1;
	
	Пока УровеньРодителя < КоличествоЭлементовПути Цикл
		
		ИмяФайлаРодителя = ОтносительныйПутьМассив[УровеньРодителя - 1];
		ИмяПараметра = "ИмяКаталог" + ЭлектронноеОбучениеСлужебныйКлиентСервер.ЧислоВСтроку(УровеньРодителя);
		ТекстУсловия = " И ЭлементыЭлектронныхРесурсов.";
		
		Для Счетчик = 1 По УровеньРодителя Цикл			
			ТекстУсловия = ТекстУсловия + "Родитель."			
		КонецЦикла;
		
		ТекстУсловия = ТекстУсловия + "ИмяФайла = &" + ИмяПараметра;			
		Запрос.Текст = Запрос.Текст + ТекстУсловия;
		Запрос.УстановитьПараметр(ИмяПараметра, ИмяФайлаРодителя);
		
		УровеньРодителя = УровеньРодителя + 1;
		
	КонецЦикла;		
	
	ИмяПараметра = "ПоследнийРодитель";
	ТекстУсловия = " И ЭлементыЭлектронныхРесурсов.";
	
	Для Счетчик = 1 По УровеньРодителя Цикл			
		ТекстУсловия = ТекстУсловия + "Родитель."			
	КонецЦикла;		
	
	ТекстУсловия = Лев(ТекстУсловия, СтрДлина(ТекстУсловия)-1);
	ТекстУсловия = ТекстУсловия + " = &" + ИмяПараметра;		
	Запрос.Текст = Запрос.Текст + ТекстУсловия;
	
	Запрос.УстановитьПараметр(ИмяПараметра, Справочники.ЭлементыЭлектронныхРесурсов.ПустаяСсылка());		
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции

// Возвращает путь к элементу относительно каталога ресурсов
//
Функция ОтносительныйПутьКЭлементуРесурса(Знач ЭлементРесурса, ДеревоЭлементовРесурса = Неопределено) Экспорт
	
	ДанныеФайла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлементРесурса, "Владелец, ЭтоВнешнийЭлемент, ИмяФайла");	
	
	Если ДанныеФайла.ЭтоВнешнийЭлемент Тогда
		Возврат ДанныеФайла.ИмяФайла;
	КонецЕсли;	
	
	Ресурс = ДанныеФайла.Владелец;	
	
	Если ДеревоЭлементовРесурса = Неопределено Тогда
		ДеревоЭлементовРесурса = ДеревоЭлементов(Ресурс);
	КонецЕсли;	
	
	СтрокаДерева = НайтиЭлементВДереве(ДеревоЭлементовРесурса.Строки, ЭлементРесурса);
	
	Если СтрокаДерева = Неопределено Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Элемент %1 не найден в ресурсе %2'"), ЭлементРесурса, Ресурс);
	КонецЕсли;
	
	ПутьКЭлементу = ДанныеФайла.ИмяФайла;
	РодительЭлемента = СтрокаДерева.Родитель;
	
	Пока РодительЭлемента <> Неопределено Цикл
		ПутьКЭлементу = РодительЭлемента.ИмяФайла + "/" + ПутьКЭлементу;
		РодительЭлемента = РодительЭлемента.Родитель;
	КонецЦикла;
	
	ПутьКЭлементу = Строка(Ресурс.УникальныйИдентификатор()) + "/" + ПутьКЭлементу;	// Добавляем каталог ресурса
	
	Возврат ПутьКЭлементу;   
	
КонецФункции

Функция НайтиЭлементВДереве(СтрокиДереваЭлементов, ЭлементРесурса)
	
	НайденныйЭлемент = Неопределено;
	
	Для каждого Строка Из СтрокиДереваЭлементов Цикл

		Если Строка.Ссылка = ЭлементРесурса Тогда
			НайденныйЭлемент = Строка;
			Прервать;
		КонецЕсли;

		Если Строка.ЭтоГруппа И НайденныйЭлемент = Неопределено Тогда
			НайденныйЭлемент = НайтиЭлементВДереве(Строка.Строки, ЭлементРесурса); // Рекурсия
		КонецЕсли;

		Если НайденныйЭлемент <> Неопределено Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НайденныйЭлемент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
